# Self join

## Edinburgh Buses
[Details of the database](https://sqlzoo.net/wiki/Edinburgh_Buses.) Looking at the data

```
stops(id, name)
route(num, company, pos, stop)
```

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1.
How many **stops** are in the database.

In [2]:
%%sql
SELECT COUNT(*) FROM stops;

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[(246,)]

## 2.
Find the **id** value for the stop 'Craiglockhart'

In [3]:
%%sql
SELECT id FROM stops
  WHERE name='Craiglockhart';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[(53,)]

## 3.
Give the **id** and the **name** for the **stops** on the '4' 'LRT' service.

In [4]:
%%sql
SELECT stops.id, stops.name 
  FROM stops JOIN route ON stops.id=route.stop
    WHERE num='4' AND company='LRT';

 * postgresql://postgres:***@localhost/sqlzoo
9 rows affected.

[(19, 'Bingham'),
 (53, 'Craiglockhart'),
 (85, 'Fairmilehead'),
 (115, 'Haymarket'),
 (117, 'Hillend'),
 (149, 'London Road'),
 (177, 'Northfield'),
 (179, 'Oxgangs'),
 (194, 'Princes Street')]

## 4. Routes and stops

The query shown gives the number of routes that visit either London Road (149) or Craiglockhart (53). Run the query and notice the two services that link these stops have a count of 2. Add a HAVING clause to restrict the output to these two routes.

In [5]:
%%sql
SELECT company, num, COUNT(*) n_route
  FROM route WHERE stop=149 OR stop=53
    GROUP BY company, num
    HAVING COUNT(*)=2;

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('LRT', '4', 2), ('LRT', '45', 2)]

## 5.
Execute the self join shown and observe that b.stop gives all the places you can get to from Craiglockhart, without changing routes. Change the query so that it shows the services from Craiglockhart to London Road.

```sql
SELECT a.company, a.num, a.stop, b.stop
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
WHERE a.stop=53
```

In [6]:
%%sql
SELECT a.company, a.num, a.stop AS start, b.stop terminate
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
WHERE a.stop=53 AND b.stop=149;

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('LRT', '4', 53, 149), ('LRT', '45', 53, 149)]

## 6.
The query shown is similar to the previous one, however by joining two copies of the **stops** table we can refer to **stops** by **name** rather than by number. Change the query so that the services between 'Craiglockhart' and 'London Road' are shown. If you are tired of these places try 'Fairmilehead' against 'Tollcross'

```sql
SELECT a.company, a.num, stopa.name, stopb.name
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
  JOIN stops stopa ON (a.stop=stopa.id)
  JOIN stops stopb ON (b.stop=stopb.id)
WHERE stopa.name='Craiglockhart'
```

In [7]:
%%sql
SELECT a.company, a.num, stopa.name AS start, stopb.name terminate
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
    JOIN stops stopa ON (a.stop=stopa.id)
    JOIN stops stopb ON (b.stop=stopb.id)
WHERE stopa.name='Craiglockhart' AND stopb.name='London Road';

 * postgresql://postgres:***@localhost/sqlzoo
2 rows affected.

[('LRT', '4', 'Craiglockhart', 'London Road'),
 ('LRT', '45', 'Craiglockhart', 'London Road')]

## 7. [Using a self join](https://sqlzoo.net/wiki/Using_a_self_join)

Give a list of all the services which connect stops 115 and 137 ('Haymarket' and 'Leith')

In [8]:
%%sql
SELECT DISTINCT a.company, a.num FROM
route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
WHERE a.stop=115 AND b.stop=137;

 * postgresql://postgres:***@localhost/sqlzoo
6 rows affected.

[('LRT', '12'),
 ('LRT', '2'),
 ('LRT', '22'),
 ('LRT', '25'),
 ('LRT', '2A'),
 ('SMT', 'C5')]

## 8.
Give a list of the services which connect the stops 'Craiglockhart' and 'Tollcross'

In [9]:
%%sql
SELECT a.company, a.num
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
    JOIN stops stopa ON (a.stop=stopa.id)
    JOIN stops stopb ON (b.stop=stopb.id)
WHERE stopa.name='Craiglockhart' AND stopb.name='Tollcross';

 * postgresql://postgres:***@localhost/sqlzoo
4 rows affected.

[('LRT', '10'), ('LRT', '27'), ('LRT', '45'), ('LRT', '47')]

## 9.
Give a distinct list of the **stops** which may be reached from 'Craiglockhart' by taking one bus, including 'Craiglockhart' itself, offered by the LRT company. Include the company and bus no. of the relevant services.

In [10]:
%%sql
SELECT DISTINCT stopb.name stop, a.company, a.num
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
    JOIN stops stopa ON (a.stop=stopa.id)
    JOIN stops stopb ON (b.stop=stopb.id)
WHERE stopa.name='Craiglockhart' AND a.company='LRT';

 * postgresql://postgres:***@localhost/sqlzoo
46 rows affected.

[('Balerno Church', 'LRT', '47'),
 ('Princes Street', 'LRT', '10'),
 ('Currie', 'LRT', '45'),
 ('Canonmills', 'LRT', '27'),
 ('London Road', 'LRT', '45'),
 ('Fairmilehead', 'LRT', '4'),
 ('Riccarton Campus', 'LRT', '45'),
 ('Tollcross', 'LRT', '45'),
 ('Craiglockhart', 'LRT', '10'),
 ('Tollcross', 'LRT', '47'),
 ('Hunters Tryst', 'LRT', '27'),
 ('Leith', 'LRT', '10'),
 ('Torphin', 'LRT', '10'),
 ('Duddingston', 'LRT', '45'),
 ('Craiglockhart', 'LRT', '27'),
 ('Craiglockhart', 'LRT', '47'),
 ('Hillend', 'LRT', '4'),
 ('Balerno', 'LRT', '47'),
 ('Craiglockhart', 'LRT', '45'),
 ('Muirhouse', 'LRT', '10'),
 ('Silverknowes', 'LRT', '27'),
 ('Cockburn Crescent', 'LRT', '47'),
 ('Colinton', 'LRT', '45'),
 ('Leith Walk', 'LRT', '10'),
 ('Craiglockhart', 'LRT', '4'),
 ('Silverknowes', 'LRT', '10'),
 ('Hanover Street', 'LRT', '47'),
 ('Hanover Street', 'LRT', '27'),
 ('Oxgangs', 'LRT', '4'),
 ('Bingham', 'LRT', '4'),
 ('Tollcross', 'LRT', '10'),
 ('Northfield', 'LRT', '4'),
 ('Oxgangs', 'LRT', '27'),
 ('Colinton', 'LRT', '47'),
 ('Northfield', 'LRT', '45'),
 ('Crewe Toll', 'LRT', '27'),
 ('Currie', 'LRT', '47'),
 ('Hanover Street', 'LRT', '45'),
 ('Colinton', 'LRT', '10'),
 ('Brunstane', 'LRT', '45'),
 ('Haymarket', 'LRT', '4'),
 ('London Road', 'LRT', '4'),
 ('Newhaven', 'LRT', '10'),
 ('Tollcross', 'LRT', '27'),
 ('Princes Street', 'LRT', '4'),
 ('Canonmills', 'LRT', '47')]

## 10.
Find the routes involving two buses that can go from **Craiglockhart** to **Lochend**.
Show the bus no. and company for the first bus, the name of the stop for the transfer,
and the bus no. and company for the second bus.

> _Hint_    
> Self-join twice to find buses that visit Craiglockhart and Lochend, then join those on matching stops.

In [11]:
%%sql
SELECT num1, company1, transfer, num2, company2 FROM
(SELECT DISTINCT stopb.name transfer, a.company company1, a.num num1, b.stop stopid
 FROM route a JOIN route b ON
 (a.company=b.company AND a.num=b.num)
 JOIN stops stopa ON (a.stop=stopa.id)
 JOIN stops stopb ON (b.stop=stopb.id)
 WHERE stopa.name='Craiglockhart') bus1 JOIN
(SELECT DISTINCT b.company company2, b.num num2, a.stop stopid
 FROM route a JOIN route b ON
 (a.company=b.company AND a.num=b.num)
 JOIN stops stopa ON (a.stop=stopa.id)
 JOIN stops stopb ON (b.stop=stopb.id)
 WHERE stopb.name='Lochend') bus2
ON bus1.stopid=bus2.stopid;

 * postgresql://postgres:***@localhost/sqlzoo
36 rows affected.

[('10', 'LRT', 'Princes Street', 'C5', 'SMT'),
 ('10', 'LRT', 'Princes Street', '65', 'LRT'),
 ('45', 'LRT', 'Duddingston', '46A', 'LRT'),
 ('45', 'LRT', 'Duddingston', '42', 'LRT'),
 ('45', 'LRT', 'London Road', '87A', 'LRT'),
 ('45', 'LRT', 'London Road', 'C5', 'SMT'),
 ('45', 'LRT', 'London Road', '20', 'LRT'),
 ('45', 'LRT', 'London Road', '34', 'LRT'),
 ('45', 'LRT', 'London Road', '46A', 'LRT'),
 ('45', 'LRT', 'London Road', '87', 'LRT'),
 ('45', 'LRT', 'London Road', '42', 'LRT'),
 ('45', 'LRT', 'London Road', '35', 'LRT'),
 ('45', 'LRT', 'London Road', '65', 'LRT'),
 ('47', 'LRT', 'Canonmills', '34', 'LRT'),
 ('47', 'LRT', 'Canonmills', '35', 'LRT'),
 ('4', 'LRT', 'Princes Street', 'C5', 'SMT'),
 ('4', 'LRT', 'Princes Street', '65', 'LRT'),
 ('10', 'LRT', 'Leith', '87', 'LRT'),
 ('10', 'LRT', 'Leith', '34', 'LRT'),
 ('10', 'LRT', 'Leith', '35', 'LRT'),
 ('10', 'LRT', 'Leith', 'C5', 'SMT'),
 ('4', 'LRT', 'Haymarket', 'C5', 'SMT'),
 ('4', 'LRT', 'Haymarket', '65', 'LRT'),
 ('27', 'LRT', 'Crewe Toll', '20', 'LRT'),
 ('45', 'LRT', 'Riccarton Campus', '65', 'LRT'),
 ('27', 'LRT', 'Canonmills', '34', 'LRT'),
 ('27', 'LRT', 'Canonmills', '35', 'LRT'),
 ('4', 'LRT', 'London Road', '87A', 'LRT'),
 ('4', 'LRT', 'London Road', 'C5', 'SMT'),
 ('4', 'LRT', 'London Road', '20', 'LRT'),
 ('4', 'LRT', 'London Road', '34', 'LRT'),
 ('4', 'LRT', 'London Road', '46A', 'LRT'),
 ('4', 'LRT', 'London Road', '87', 'LRT'),
 ('4', 'LRT', 'London Road', '42', 'LRT'),
 ('4', 'LRT', 'London Road', '35', 'LRT'),
 ('4', 'LRT', 'London Road', '65', 'LRT')]